In [13]:
import pandas as pd 
import json
data = pd.read_csv("./Dataset/movie_lens/tmdb_5000_credits.csv") 
data.head()

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."
3,49026,The Dark Knight Rises,"[{""cast_id"": 2, ""character"": ""Bruce Wayne / Ba...","[{""credit_id"": ""52fe4781c3a36847f81398c3"", ""de..."
4,49529,John Carter,"[{""cast_id"": 5, ""character"": ""John Carter"", ""c...","[{""credit_id"": ""52fe479ac3a36847f813eaa3"", ""de..."

In [14]:
castDf = pd.DataFrame({'movieId':[], 'person_name':[], 'role':[]})

for index, row in data.iterrows():
    movieId = row['movie_id'] 
    c = pd.DataFrame.from_dict(json.loads(row['cast']))
    for index, row in c.iterrows():
        castDf.loc[len(castDf)] = [str(movieId), row['name'], row['character']]

In [15]:
castDf.count()

movieId        106257
person_name    106257
role           106257
dtype: int64

In [16]:
castDf.head()

  movieId         person_name                 role
0   19995     Sam Worthington           Jake Sully
1   19995         Zoe Saldana              Neytiri
2   19995    Sigourney Weaver  Dr. Grace Augustine
3   19995        Stephen Lang        Col. Quaritch
4   19995  Michelle Rodriguez         Trudy Chacon

In [23]:
castDf.to_csv("./Dataset/Fullactors2.csv",index=False)

In [26]:
castDf1 = pd.read_csv('./Dataset/Fullactors2.csv',index_col=0)
castDf1.head()

   movieId         person_name                 role
0    19995     Sam Worthington           Jake Sully
1    19995         Zoe Saldana              Neytiri
2    19995    Sigourney Weaver  Dr. Grace Augustine
3    19995        Stephen Lang        Col. Quaritch
4    19995  Michelle Rodriguez         Trudy Chacon

In [30]:
castDf.count()

movieId        106257
person_name    106257
role           106257
dtype: int64

In [31]:
castDf2=castDf.copy()
castDf2.count()

movieId        106257
person_name    106257
role           106257
dtype: int64

In [33]:
castDf2['count'] = castDf2.groupby('person_name')['person_name'].transform(pd.Series.value_counts)

In [38]:
castDf2['count'] =castDf2.groupby('person_name')['person_name'].transform('count')

In [39]:
castDf2.head()

  movieId         person_name                 role  count
0   19995     Sam Worthington           Jake Sully     10
1   19995         Zoe Saldana              Neytiri     20
2   19995    Sigourney Weaver  Dr. Grace Augustine     33
3   19995        Stephen Lang        Col. Quaritch     11
4   19995  Michelle Rodriguez         Trudy Chacon     13

In [40]:
castDf2 = castDf2[castDf2['count']>5]
castDf2.drop('count', axis=1, inplace=True)
castDf2.count()

C:\Users\Admin\AppData\Local\Temp\ipykernel_4260\346006753.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  castDf2.drop('count', axis=1, inplace=True)

movieId        33470
person_name    33470
role           33470
dtype: int64

In [41]:
castDf2.to_csv('./Dataset/actors.csv')

Director

In [42]:
directorDf = pd.DataFrame({'movieId':[], 'person_name':[]})

for index, row in data.iterrows():
    movieId = row['movie_id']
    crew = pd.DataFrame.from_dict(json.loads(row['crew']))
    if (not (crew.empty)):
        nameList = crew[crew['job']=='Director']['name'].values
        if (len(nameList)>0):
            directorDf.loc[len(directorDf)] = [str(movieId), nameList[0]]  
directorDf.count()

movieId        4773
person_name    4773
dtype: int64

In [43]:
directorDf['count'] = directorDf.groupby('person_name')['person_name'].transform('count')
directorDf = directorDf[directorDf['count']>3]
directorDf.drop('count', axis=1, inplace=True)
directorDf.count()

movieId        2058
person_name    2058
dtype: int64

In [44]:
castDf2.to_csv('./Dataset/directors.csv')

## edit movies.csv

In [1]:
import pandas as pd 
import json

In [23]:
df = pd.read_csv("./Dataset/data/movies.csv")
df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [28]:
a= list(df['genres'])

In [29]:
a= [ "{"+ ",".join(list(map(lambda x: '"'+x+'"',txt.split("|")))) + "}"  for txt in a]

In [30]:
df['genres']=a
df.head()

,movieId,title,genres
0,1,Toy Story (1995),"{""Adventure"",""Animation"",""Children"",""Comedy"",""..."
1,2,Jumanji (1995),"{""Adventure"",""Children"",""Fantasy""}"
2,3,Grumpier Old Men (1995),"{""Comedy"",""Romance""}"
3,4,Waiting to Exhale (1995),"{""Comedy"",""Drama"",""Romance""}"
4,5,Father of the Bride Part II (1995),"{""Comedy""}"

In [33]:
len(df)

9742

In [34]:
df.to_csv('./Dataset/data/editedMovies1.csv',index=False)

In [35]:
df.head()

,movieId,title,genres
0,1,Toy Story (1995),"{""Adventure"",""Animation"",""Children"",""Comedy"",""..."
1,2,Jumanji (1995),"{""Adventure"",""Children"",""Fantasy""}"
2,3,Grumpier Old Men (1995),"{""Comedy"",""Romance""}"
3,4,Waiting to Exhale (1995),"{""Comedy"",""Drama"",""Romance""}"
4,5,Father of the Bride Part II (1995),"{""Comedy""}"

### change timestamp to datetime in tags.csv

In [36]:
tagdf = pd.read_csv("./Dataset/data/tags.csv") 
tagdf.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [39]:
from datetime import datetime
tagdf['timestamp']= list(map(datetime.fromtimestamp, list(tagdf["timestamp"])))
tagdf.head()

   userId  movieId              tag           timestamp
0       2    60756            funny 2015-10-25 02:29:54
1       2    60756  Highly quotable 2015-10-25 02:29:56
2       2    60756     will ferrell 2015-10-25 02:29:52
3       2    89774     Boxing story 2015-10-25 02:33:27
4       2    89774              MMA 2015-10-25 02:33:20

In [ ]:
tagdf.to_csv("./Dataset/data/editedTags.csv", index=False)